INSERT INTO Authors (AuthorID, FirstName, LastName) VALUES 
(1, 'Евгений', 'Водолазкин'),
(2, 'Оксана', 'Васякина'),
(3, 'Алексей', 'Сальников'),
(4, 'Вера', 'Богданова'),
(5, 'Гузель', 'Яхина');

INSERT INTO Books (BookID, Title, AuthorID, Price) VALUES 
(1, 'Лавр', 1, 1200.50),
(2, 'Авиатор', 1, 800.00),
(3, 'Рана', 2, 950.00),
(4, 'Роза', 2, 700.50),
(5, 'Петровы в гриппе и вокруг него', 3, 600.00),
(6, 'Когната', 3, 550.00),
(7, 'Сезон отравленных плодов', 4, 450.00),
(8, 'Семь способов засолки душ', 4, 400.00),
(9, 'Зулейха открывает глаза', 5, 650.00),
(10, 'Эшелон на Самарканд', 5, 500.00);

DELETE FROM Books;   -- Сначала дочерняя таблица
DELETE FROM Authors; -- Затем родительская таблица

SELECT COUNT(*) FROM Authors;
SELECT COUNT(*) FROM Books;

SELECT name FROM sqlite_master WHERE type='table';